In [15]:
import pandas as pd
path="D:/Tutedude-py/Tutedude-python-code-learn/data analysis/data.xlsx"
df=pd.read_excel(path)
print(df)

    S.No     A   B   C     D   E
0      1   2.0   1   5   3.0   4
1      2   4.0   3  10   6.0   8
2      3   6.0   5  15   9.0  12
3      4   8.0   7  20  12.0  16
4      5  10.0   9  25  15.0  20
5      6  12.0  11  30  18.0  24
6      7  14.0  13  35  21.0  28
7      8  16.0  15  40  24.0  32
8      9  18.0  17  45  27.0  36
9     10  20.0  19  50  30.0  40
10    11   NaN  21  55   NaN  44

In [8]:
df.head(5)

   S.No   A  B   C   D   E
0     1   2  1   5   3   4
1     2   4  3  10   6   8
2     3   6  5  15   9  12
3     4   8  7  20  12  16
4     5  10  9  25  15  20

In [18]:
headers=["s.no","Even","odd","Multiples 5","Multiples 3","multiples 4"]
df.columns = headers
df.head(5)

   s.no  Even  odd  Multiples 5  Multiples 3  multiples 4
0     1   2.0    1            5          3.0            4
1     2   4.0    3           10          6.0            8
2     3   6.0    5           15          9.0           12
3     4   8.0    7           20         12.0           16
4     5  10.0    9           25         15.0           20

In [10]:
df["odd"]=df["odd"]+1

In [19]:
df.head(5)

   s.no  Even  odd  Multiples 5  Multiples 3  multiples 4
0     1   2.0    1            5          3.0            4
1     2   4.0    3           10          6.0            8
2     3   6.0    5           15          9.0           12
3     4   8.0    7           20         12.0           16
4     5  10.0    9           25         15.0           20

In [12]:
df["odd"]=df["odd"]-1

In [20]:
df.head(5)

   s.no  Even  odd  Multiples 5  Multiples 3  multiples 4
0     1   2.0    1            5          3.0            4
1     2   4.0    3           10          6.0            8
2     3   6.0    5           15          9.0           12
3     4   8.0    7           20         12.0           16
4     5  10.0    9           25         15.0           20

In [26]:
print(df)

    s.no  Even  odd  Multiples 5  Multiples 3  multiples 4
0      1   2.0    1            5          3.0            4
1      2   4.0    3           10          6.0            8
2      3   6.0    5           15          9.0           12
3      4   8.0    7           20         12.0           16
4      5  10.0    9           25         15.0           20
5      6  12.0   11           30         18.0           24
6      7  14.0   13           35         21.0           28
7      8  16.0   15           40         24.0           32
8      9  18.0   17           45         27.0           36
9     10  20.0   19           50         30.0           40
10    11   NaN   21           55          NaN           44

In [25]:
# df.drop([10],axis=0)#remove row & columd
# df.dropna(subset=["Even"],axis=0)

   s.no  Even  odd  Multiples 5  Multiples 3  multiples 4
0     1   2.0    1            5          3.0            4
1     2   4.0    3           10          6.0            8
2     3   6.0    5           15          9.0           12
3     4   8.0    7           20         12.0           16
4     5  10.0    9           25         15.0           20
5     6  12.0   11           30         18.0           24
6     7  14.0   13           35         21.0           28
7     8  16.0   15           40         24.0           32
8     9  18.0   17           45         27.0           36
9    10  20.0   19           50         30.0           40

In [29]:
import numpy as np
df["Even"].replace(np.nan,22)

0      2.0
1      4.0
2      6.0
3      8.0
4     10.0
5     12.0
6     14.0
7     16.0
8     18.0
9     20.0
10    22.0
Name: Even, dtype: float64

In [35]:
print(df.columns)
df["multiples 4"] = df["multiples 4"] / 2

Index(['s.no', 'Even', 'odd', 'Multiples 5', 'Multiples 3', 'multiples 4'], dtype='object')

In [37]:
df.head(5)

   s.no  Even  odd  Multiples 5  Multiples 3  multiples 4
0     1   2.0    1            5          3.0          2.0
1     2   4.0    3           10          6.0          4.0
2     3   6.0    5           15          9.0          6.0
3     4   8.0    7           20         12.0          8.0
4     5  10.0    9           25         15.0         10.0

In [38]:
df.rename(columns={"multiples 4":"Multiples 2"})

    s.no  Even  odd  Multiples 5  Multiples 3  Multiples 2
0      1   2.0    1            5          3.0          2.0
1      2   4.0    3           10          6.0          4.0
2      3   6.0    5           15          9.0          6.0
3      4   8.0    7           20         12.0          8.0
4      5  10.0    9           25         15.0         10.0
5      6  12.0   11           30         18.0         12.0
6      7  14.0   13           35         21.0         14.0
7      8  16.0   15           40         24.0         16.0
8      9  18.0   17           45         27.0         18.0
9     10  20.0   19           50         30.0         20.0
10    11   NaN   21           55          NaN         22.0

In [39]:
df.dtypes

s.no             int64
Even           float64
odd              int64
Multiples 5      int64
Multiples 3    float64
multiples 4    float64
dtype: object

In [40]:
df.drop([10],axis=0)

   s.no  Even  odd  Multiples 5  Multiples 3  multiples 4
0     1   2.0    1            5          3.0          2.0
1     2   4.0    3           10          6.0          4.0
2     3   6.0    5           15          9.0          6.0
3     4   8.0    7           20         12.0          8.0
4     5  10.0    9           25         15.0         10.0
5     6  12.0   11           30         18.0         12.0
6     7  14.0   13           35         21.0         14.0
7     8  16.0   15           40         24.0         16.0
8     9  18.0   17           45         27.0         18.0
9    10  20.0   19           50         30.0         20.0

In [42]:
df.rename(columns = {"multiples 4":"Multiples 2"},inplace =True)

In [43]:
df.head(5)

   s.no  Even  odd  Multiples 5  Multiples 3  Multiples 2
0     1   2.0    1            5          3.0          2.0
1     2   4.0    3           10          6.0          4.0
2     3   6.0    5           15          9.0          6.0
3     4   8.0    7           20         12.0          8.0
4     5  10.0    9           25         15.0         10.0

In [44]:
df.dtypes

s.no             int64
Even           float64
odd              int64
Multiples 5      int64
Multiples 3    float64
Multiples 2    float64
dtype: object

In [45]:
df["Multiples 2"]=df["Multiples 2"].astype("int")

In [46]:
df.head(5)

   s.no  Even  odd  Multiples 5  Multiples 3  Multiples 2
0     1   2.0    1            5          3.0            2
1     2   4.0    3           10          6.0            4
2     3   6.0    5           15          9.0            6
3     4   8.0    7           20         12.0            8
4     5  10.0    9           25         15.0           10

In [47]:
df.dtypes

s.no             int64
Even           float64
odd              int64
Multiples 5      int64
Multiples 3    float64
Multiples 2      int64
dtype: object